// See https://aka.ms/new-console-template for more information
using System.Text;
using RC5Lib;

RC5 rc5 = new RC5();
string message = "Ничего нового.\r\n   С девяти до часа работал в библиотеке. Привел в порядок XII главу" +
    " и все, что касается пребывания Рольбона в России до смерти Павла I. Эта часть работы закончена " +
    "– к ней нужно будет вернуться только при переписке набело.\r\n   Сейчас половина второго. Сижу " +
    "в кафе «Мабли», ем сандвич, все почти в порядке. Впрочем, в любом кафе все всегда в " +
    "порядке, и в особенности в кафе «Мабли» благодаря хозяину мсье Фаскелю, на лице которого " +
    "с успокоительной определенностью написано: «прохвост». Близится час, когда он уходит поспать, " +
    "глаза у него уже покраснели, но повадка все такая же живая и решительная. Он прохаживается " +
    "между столиками, доверительно наклоняясь к клиентам:\r\n   – Все хорошо, мсье?\r\n   " +
    "Я с улыбкой наблюдаю его оживление – в часы, когда его заведение пусто, пустеет и его голова. " +
    "С двух до четырех в кафе никого не остается, тогда мсье Фаскель сонно делает несколько шагов, " +
    "официанты гасят свет, и сознание его выключается – наедине с собой этот человек всегда спит.\r\n   " +
    "Но пока в кафе еще остается десятка два клиентов – это холостяки, невысокого ранга инженеры, служащие. " +
    "Обычно они наспех обедают в семейных пансионах, которые зовут своей столовкой, и поскольку всем им хочется " +
    "позволить себе шикнуть, они, пообедав, приходят сюда выпить по чашечке кофе и поиграть в кости. " +
    "Они шумят, негромко и нестройно, – такой шум мне не мешает. Им тоже, чтобы существовать, надо " +
    "держаться кучно.\r\n   А я живу один, совершенно один. Не разговариваю ни с кем и никогда; " +
    "ничего не беру, ничего не даю. Самоучка не в счет. Есть, конечно, Франсуаза, хозяйка «Приюта " +
    "Путейцев». Но разве я с ней разговариваю? Иногда после ужина, когда она подает мне кружку пива, " +
    "я спрашиваю:\r\n   – У вас сегодня вечером найдется минутка?";
Console.WriteLine("Исходное сообщение: " + message);
string encrypted = rc5.Encrypt(message);
Console.WriteLine("Зашифрованное сообщение: " + encrypted);
string decrypted = rc5.Decrypt(encrypted);
Console.WriteLine("Расшифрованное сообщение: " + decrypted);